<?php
/* -----------------------------------------------------------------------------------------
   $Id: vam_rus_chars.inc.php 899 2007-02-07 10:51:57 VaM $

   VaM Shop - open source ecommerce solution
   http://vamshop.ru
   http://vamshop.com

   Copyright (c) 2007 VaM Shop
   -----------------------------------------------------------------------------------------
   based on: 
   (c) 2000-2001 The Exchange Project  (earlier name of osCommerce)
   (c) 2002-2003 osCommerce(general.php,v 1.225 2003/05/29); www.oscommerce.com
   (c) 2003	 nextcommerce (vam_get_prid.inc.php,v 1.3 2003/08/13); www.nextcommerce.org 
   (c) 2004 xt:Commerce (vam_get_prid.inc.php,v 1.3 2004/08/25); xt-commerce.com

   Released under the GNU General Public License 
   ---------------------------------------------------------------------------------------*/
   
// Return a product ID from a product ID with attributes

function String_RusCharsDeCode($string)
{
//russian text escape code, for unescape: (bug : %u0410 -%u044f)
$russian_codes = array('%u0410','%u0411','%u0412','%u0413','%u0414','%u0415','%u0401','%u0416','%u0417','%u0418','%u0419','%u041A','%u041B','%u041C','%u041D','%u041E','%u041F','%u0420','%u0421','%u0422','%u0423','%u0424','%u0425','%u0426','%u0427','%u0428','%u0429','%u042A','%u042B','%u042C','%u042D','%u042E','%u042F','%u0430','%u0431','%u0432','%u0433','%u0434','%u0435','%u0451','%u0436','%u0437','%u0438','%u0439','%u043A','%u043B','%u043C','%u043D','%u043E','%u043F','%u0440','%u0441','%u0442','%u0443','%u0444','%u0445','%u0446','%u0447','%u0448','%u0449','%u044A','%u044B','%u044C','%u044D','%u044E','%u044F');
   $russian_chars = array("А",     "Б",     "В",     "Г",     "Д",     "Е",     "Ё",     "Ж",     "З",     "И",     "Й",     "К",     "Л",     "М",     "Н",     "О",     "П",     "Р",     "С",     "Т",     "У",     "Ф",     "Х",     "Ц",     "Ч",     "Ш",     "Щ",     "Ъ",     "Ы",     "Ь",     "Э",     "Ю",     "Я",     "а",     "б",     "в",     "г",     "д",     "е",     "ё",     "ж",     "з",     "и",     "й",     "к",     "л",     "м",     "н",     "о",     "п",     "р",     "с",     "т",     "у",     "ф",     "х",     "ц",     "ч",     "ш",     "щ",     "ъ",     "ы",     "ь",     "э",     "ю",     "я");
   return str_replace($russian_codes,$russian_chars,$string);
}

function String_RusCharsEnCode($string)
{
$russian_codes = array('%u0410','%u0411','%u0412','%u0413','%u0414','%u0415','%u0401','%u0416','%u0417','%u0418','%u0419','%u041A','%u041B','%u041C','%u041D','%u041E','%u041F','%u0420','%u0421','%u0422','%u0423','%u0424','%u0425','%u0426','%u0427','%u0428','%u0429','%u042A','%u042B','%u042C','%u042D','%u042E','%u042F','%u0430','%u0431','%u0432','%u0433','%u0434','%u0435','%u0451','%u0436','%u0437','%u0438','%u0439','%u043A','%u043B','%u043C','%u043D','%u043E','%u043F','%u0440','%u0441','%u0442','%u0443','%u0444','%u0445','%u0446','%u0447','%u0448','%u0449','%u044A','%u044B','%u044C','%u044D','%u044E','%u044F');
   $russian_chars = array("А",     "Б",     "В",     "Г",     "Д",     "Е",     "Ё",     "Ж",     "З",     "И",     "Й",     "К",     "Л",     "М",     "Н",     "О",     "П",     "Р",     "С",     "Т",     "У",     "Ф",     "Х",     "Ц",     "Ч",     "Ш",     "Щ",     "Ъ",     "Ы",     "Ь",     "Э",     "Ю",     "Я",     "а",     "б",     "в",     "г",     "д",     "е",     "ё",     "ж",     "з",     "и",     "й",     "к",     "л",     "м",     "н",     "о",     "п",     "р",     "с",     "т",     "у",     "ф",     "х",     "ц",     "ч",     "ш",     "щ",     "ъ",     "ы",     "ь",     "э",     "ю",     "я");
   return str_replace($russian_chars,$russian_codes,$string);
}

 ?>